{
  "ABOUT_ME_DESCRIPTION": "Passionate Full Stack developer with {{experience}} years of experience in creating robust and efficient web applications. My main focus is on Angular and NestJS for backend and frontend development, but I also have experience with React and Next.js. I consider myself a code craftsman, always seeking the best solution for each technical challenge. My journey has allowed me to collaborate on projects in various industries, from innovative startups to established companies. In each experience, I have gained valuable knowledge and honed my skills in developing scalable, secure, and easy-to-maintain solutions. I am excited to work as part of a team and collaborate with other professionals to achieve common goals. I am a firm believer in open communication and continuous improvement, always eager to learn and share knowledge. If you are looking for a committed, proactive Full Stack developer with a strong technical foundation, let's talk! I am confident that we can build great things together.",
  "HEADER_SUBTITLE": "Building efficient and scalable web experiences",
  "BY": "by",
  "YEARS": "years",
  "YEAR": "year",
  "MONTHS": "months",
  "MONTH": "month",
  "TIMELINE": "Experience",
  "FIND_MY_PROJECTS_AND_CONTRIBUTIONS_ON_GITHUB": "Find my projects and contributions on GitHub",
  "FIND_MY_EXPERIENCE_AND_EDUCATION_ON_LINKEDIN": "Find my experience and education on LinkedIn",
  "GFT_WORK_DESCRIPTION": "Currently, I work as a Frontend Developer at GFT, a leading technology consulting firm. My current project involves developing an innovative insurance platform for Mapfre, one of the largest insurance companies in Spain. In this project, my main responsibility is creating and maintaining reusable components in the form of libraries, using Angular and Nx as the main tools. These libraries, developed under the Nx monorepo architecture, enable greater modularity, scalability, and efficiency in the development process, facilitating collaboration among team members and ensuring consistency throughout the application. Additionally, I actively participate in implementing new features and improvements in the platform, following Mapfre's specifications and requirements. My goal is to contribute to the development of a cutting-edge technological solution that meets Mapfre's quality and security standards and provides an exceptional user experience to its customers.",
  "NAX_WORK_DESCRIPTION": "As a Team Lead Frontend and Developer, I led a team of 4 professionals in designing and developing a state-of-the-art web application for managing large-scale agricultural areas from scratch. In this project, I took responsibility for frontend architecture and development, as well as team coordination and supervision. The application, based on Angular and NestJS technologies, integrates Artificial Intelligence and Machine Learning algorithms to optimize planning and resource management in the agricultural sector. My experience in this project allowed me to consolidate my leadership, communication, and project management skills, as well as delve into the development of innovative technological solutions for the agricultural sector.",
  "GESTORES_WORK_DESCRIPTION": "As a Team Lead Frontend, I led the comprehensive development of the company's personnel management platform, both for internal and external use. This platform, key to optimizing internal processes, allowed for time tracking, vacation and absence management, as well as other functionalities related to human resources administration. In this project, I led a team of 6 frontend developers, coordinating tasks, establishing quality standards, and ensuring timely delivery of results. Close collaboration with the backend team was essential to achieve seamless integration between both parts of the application. This experience provided me with the opportunity to strengthen my leadership, communication, and team management skills, as well as delve into the development of high-impact technological solutions for business management.",
  "OURSIDE_WORK_DESCRIPTION": "As a freelance Full Stack developer, I worked full-time with an Irish company in developing various high-impact web applications. Despite being a small team of only 4 people, we achieved significant results in key projects for the Irish market. Among the most notable projects is a real-time football results platform, which became a reference for sports fans in Ireland. We also developed an application for purchasing tickets at pubs, facilitating access to events and promotions for users. Another project of great relevance was a food delivery order management application, which allowed restaurants and customers to optimize the food purchasing and delivery process. This experience provided me with the opportunity to work in an international and multicultural environment, adapting to different work methodologies and developing innovative technological solutions for various sectors.",
  "CONWORK_WORK_DESCRIPTION": "In this company, I started my professional career as a frontend developer and participated in the modernization of an existing project. Together with a colleague, I carried out the migration from a monolithic architecture to a separate backend and frontend structure, taking responsibility for frontend development and maintenance. This experience allowed me to acquire solid knowledge in frontend technologies and understand the importance of a modular and scalable architecture in web application development."
}