{
  "ABOUT_ME_DESCRIPTION": "Apasionado desarrollador Full Stack con {{experience}} años de experiencia en la creación de aplicaciones web robustas y eficientes. Soy un apasionado desarrollador Full Stack con un enfoque principal en Angular y NestJS, aunque también me desenvuelvo con soltura en React y Next.js; me considero un artesano del código, disfrutando cada línea que escribo y buscando siempre la solución más elegante y eficiente para cada desafío técnico. Mi trayectoria profesional me ha llevado a colaborar en proyectos de diversas industrias, desde startups ágiles y disruptivas hasta empresas consolidadas con años de experiencia en el mercado; esta diversidad me ha permitido adquirir una visión amplia y versátil del desarrollo de software, adaptándome a diferentes entornos y metodologías de trabajo. En cada proyecto, me he esforzado por crear soluciones escalables, seguras y fáciles de mantener, aplicando las mejores prácticas y estándares de la industria; mi pasión por la tecnología me impulsa a estar siempre al día con las últimas tendencias y herramientas, buscando constantemente nuevas formas de mejorar mi trabajo y aportar valor a los proyectos en los que participo. Soy un jugador de equipo nato, disfruto colaborando con otros profesionales y compartiendo conocimientos para alcanzar objetivos comunes; creo firmemente en la comunicación abierta y transparente, así como en la importancia de aprender de los errores y buscar constantemente la mejora continua. Si estás buscando un desarrollador Full Stack comprometido, proactivo y con una sólida base técnica, ¡no dudes en contactarme! Estoy seguro de que podemos trabajar juntos para crear soluciones tecnológicas innovadoras y de alto impacto.",
  "HEADER_SUBTITLE": "Construyendo experiencias web eficientes y escalables",
  "BY": "por",
  "YEARS": "años",
  "YEAR": "año",
  "APTITUDES": "Aptitudes",
  "MONTHS": "meses",
  "MONTH": "mes",
  "TIMELINE": "Experiencia",
  "FIND_MY_PROJECTS_AND_CONTRIBUTIONS_ON_GITHUB": "Encuentra mis proyectos y contribuciones en GitHub",
  "FIND_MY_EXPERIENCE_AND_EDUCATION_ON_LINKEDIN": "Encuentra mi experiencia y educación en LinkedIn",
  "GFT_WORK_DESCRIPTION": "Actualmente, trabajo como Desarrollador Frontend en GFT, una consultora tecnológica líder en el sector. Mi proyecto actual consiste en el desarrollo de una innovadora plataforma de seguros para Mapfre, una de las aseguradoras más importantes de España. En este proyecto, mi responsabilidad principal es la creación y mantenimiento de componentes reutilizables en forma de librerías, utilizando Angular y Nx como herramientas principales. Estas librerías, desarrolladas bajo la arquitectura de monorepos de Nx, permiten una mayor modularidad, escalabilidad y eficiencia en el proceso de desarrollo, facilitando la colaboración entre los miembros del equipo y garantizando la consistencia en toda la aplicación. Además, participo activamente en la implementación de nuevas funcionalidades y mejoras en la plataforma, siguiendo las especificaciones y requerimientos de Mapfre. Mi objetivo es contribuir al desarrollo de una solución tecnológica de vanguardia que cumpla con los estándares de calidad y seguridad de Mapfre, y que ofrezca una experiencia de usuario excepcional a sus clientes.",
  "NAX_WORK_DESCRIPTION": "Lideré como Team Lead Frontend y Desarrollador un equipo de 4 profesionales en el diseño y desarrollo desde cero de una aplicación web de vanguardia para la gestión de zonas agrícolas a gran escala. En este proyecto, asumí la responsabilidad de la arquitectura y desarrollo frontend, así como la coordinación y supervisión del equipo. La aplicación, basada en tecnologías Angular y NestJS, integra algoritmos de Inteligencia Artificial y Machine Learning para optimizar la planificación y gestión de recursos en el sector agrícola. Mi experiencia en este proyecto me permitió consolidar mis habilidades de liderazgo, comunicación y gestión de proyectos, así como profundizar en el desarrollo de soluciones tecnológicas innovadoras para el sector agrícola.",
  "GESTORES_WORK_DESCRIPTION": "Lideré como Team Lead Frontend el desarrollo integral de la plataforma de gestión de personal de la empresa, tanto para uso interno como externo. Esta plataforma, clave para la optimización de procesos internos, permitía el registro de horas de trabajo, la gestión de vacaciones y ausencias, así como otras funcionalidades relacionadas con la administración de recursos humanos. En este proyecto, dirigí un equipo de 6 desarrolladores frontend, coordinando tareas, estableciendo estándares de calidad y garantizando la entrega de resultados en tiempo y forma. La colaboración estrecha con el equipo backend resultó fundamental para lograr una integración fluida entre ambas partes de la aplicación. Esta experiencia me brindó la oportunidad de fortalecer mis habilidades de liderazgo, comunicación y gestión de equipos, así como profundizar en el desarrollo de soluciones tecnológicas de alto impacto para la gestión empresarial.",
  "OURSIDE_WORK_DESCRIPTION": "Como desarrollador Full Stack freelance, estuve a tiempo completo con una empresa irlandesa en el desarrollo de diversas aplicaciones web de alto impacto. A pesar de ser un equipo reducido de tan solo 4 personas, logramos resultados significativos en proyectos clave para el mercado irlandés. Entre los proyectos más destacados se encuentra una plataforma de resultados de fútbol en tiempo real, que se convirtió en una referencia para los aficionados al deporte en Irlanda. También desarrollamos una aplicación para la compra de entradas en pubs, facilitando el acceso a eventos y promociones a los usuarios. Otro proyecto de gran relevancia fue una aplicación de gestión de pedidos de comida a domicilio, que permitió a restaurantes y clientes optimizar el proceso de compra y entrega de alimentos.Esta experiencia me brindó la oportunidad de trabajar en un entorno internacional y multicultural, adaptándome a diferentes metodologías de trabajo y desarrollando soluciones tecnológicas innovadoras para diversos sectores.",
  "CONWORK_WORK_DESCRIPTION": "En esta empresa, inicié mi trayectoria profesional como desarrollador frontend y participé en la modernización de un proyecto existente. Llevé a cabo, junto con un compañero, la migración de una arquitectura monolítica a una estructura separada de backend y frontend, asumiendo la responsabilidad del desarrollo y mantenimiento de la interfaz de usuario. Esta experiencia me permitió adquirir conocimientos sólidos en tecnologías frontend y comprender la importancia de una arquitectura modular y escalable en el desarrollo de aplicaciones web."
}